# Bases de Datos I
## Laboratorio 9: _Full DQL_

### Configuraci√≥n ‚öôÔ∏è

Nuevamente estaremos usando el m√≥dulo de Python `sqlalchemy`, el cual nos permitir√° ejecutar c√≥digo SQL dentro de una celda de Python.

In [1]:
import sqlalchemy
sqlalchemy.create_engine("mysql://root:1q2w3e4r@localhost:3306")

Engine(mysql://root:***@localhost:3306)

In [2]:
%load_ext sql

In [3]:
%sql mysql://root:1q2w3e4r@localhost:3306

En la celda anterior se carga la extensi√≥n de SQL y se establece conexi√≥n con el servidor, utilizando el mismo _string_ especificado en la creaci√≥n del engine. 

Ahora s√≠, realicemos un par de ejerciciosssss.

### Ejercicios üèãÔ∏è‚Äç‚ôÇÔ∏è
#### Analicemos el siguiente escenario

La Oficina del Festival Internacional del Nuevo Cine Latinoamericano es la
encargada cada a√±o de la organizaci√≥n del Festival Internacional del Nuevo Cine
Latinoamericano. Para esto cuenta con un sistema automatizado que maneja
cierta informaci√≥n contenida en una base de datos de la cual se muestra un
fragmento a continuaci√≥n:

**Pel√≠cula** (<u>IDPeli</u>, T√≠tulo , Director, Pa√≠s, Duraci√≥n, A√±o, IDSecc) 

IDSecc **FK** Secci√≥n. No admite nulos 


**Jurado** (<u>IDJur</u>, Nombre, Pa√≠s, FechaDeNacimiento, IDSecc)

IDSecc **FK** Secci√≥n. No admite nulos 

**Secci√≥n** (<u>IDSecc</u>, Nombre, Tipo)

**Pel√≠culaGanadora** (<u>IDPremiada</u>, IDPeli, NombrePremio)

IDPeli **FK** Pel√≠cula. No admite nulos


#### --> Ejecute las siguientes sentencias SQL para la creaci√≥n de una base de datos `FestivalDeCine` que corresponda a las relaciones presentadas.

In [4]:
%%sql 

DROP DATABASE IF EXISTS FestivalDeCine34;
CREATE DATABASE FestivalDeCine34;
USE FestivalDeCine34;

 * mysql://root:***@localhost:3306
4 rows affected.
1 rows affected.
0 rows affected.

[]

In [5]:
%%sql 

CREATE TABLE IF NOT EXISTS Secci√≥n (
  IDSecc int(11) NOT NULL AUTO_INCREMENT,
  Nombre varchar(50) NOT NULL,
  Tipo varchar(50) NOT NULL,
  PRIMARY KEY (IDSecc),
  UNIQUE (Nombre)
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [6]:
%%sql 

INSERT INTO `Secci√≥n` (`IDSecc`, `Nombre`, `Tipo`) VALUES
(1, 'Panorama Latinoamericano', 'Fuera de competencia'),
(2, 'Panorama Contempor√°neo Internacional', 'Fuera de competencia'),
(3, '√ìperas Primas', 'En competencia'),
(4, 'Ficci√≥n', 'En competencia'),
(5, 'World Cinema Fund', 'Fuera de competencia'),
(6, 'Muestra de Cine Polaco', 'Fuera de competencia'),
(7, 'Documental', 'En competencia'),
(8, 'Muestra de Cine Italiano', 'Fuera de competencia'),
(9, 'Muestra de Cine Canadiense', 'Fuera de competencia'),
(10, 'Muestra de Cine Alem√°n', 'Fuera de competencia'),
(11, 'Muestra de Cine Espa√±ol', 'Fuera de competencia');

 * mysql://root:***@localhost:3306
11 rows affected.

[]

In [7]:
%%sql 

CREATE TABLE IF NOT EXISTS Jurado (
  IDSecc INT REFERENCES Secci√≥n(IDSecc) ON UPDATE CASCADE,
  IDJur int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  Nombre varchar(50) NOT NULL,
  Pa√≠s char(10) NOT NULL,
  FechaDeNacimiento date NOT NULL
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [8]:
%%sql 

INSERT INTO `Jurado` (`IDJur`, `Nombre`, `Pa√≠s`, `FechaDeNacimiento`, `IDSecc`) VALUES
(1, 'Boris Quercia', 'Chile', '1955-03-02', 4),
(2, 'Gast√≥n Pauls', 'Argentina', '1965-02-05', 4),
(3, '√örsula Pruneda', 'M√©xico', '1944-12-04', 4),
(4, 'Concei√ß√°o Senna', 'Brasil', '1948-11-23', 4),
(5, 'Manuel Herrera', 'Cuba', '1976-06-21', 4),
(6, 'Diego Vega', 'Per√∫', '1958-03-17', 3),
(7, 'Marit√© Ug√°s', 'Venezuela', '1966-03-27', 3),
(8, 'Esteban Insausti', 'Cuba', '1977-07-02', 3),
(9, 'Aldo Garay', 'Uruguay', '1970-05-03', 7),
(10, 'Carlos Azpur√∫a', 'Venezuela', '1973-08-04', 7),
(11, 'Rolando Almirante', 'Cuba', '1973-06-05', 7);

 * mysql://root:***@localhost:3306
11 rows affected.

[]

In [9]:
%%sql 

CREATE TABLE IF NOT EXISTS Pel√≠cula (
  IDPeli int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  T√≠tulo varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  Director varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  Pa√≠s char(10) COLLATE utf8_unicode_ci NOT NULL,
  Duraci√≥n smallint(5) unsigned NOT NULL,
  A√±o smallint(5) unsigned NOT NULL,
  IDSecc INT REFERENCES Secci√≥n(IDSecc) ON UPDATE CASCADE
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [10]:
%%sql 

INSERT INTO `Pel√≠cula` (`IDPeli`, `T√≠tulo`, `Director`, `Pa√≠s`, `Duraci√≥n`, `A√±o`, `IDSecc`) VALUES
(1, 'Un feliz acontecimiento', 'R√©mi Bezan√ßon', 'Francia', 107, 2011, 2),
(2, 'Drom√≥manos', 'In√©s de Oliveira C√©zar', 'Argentina', 90, 2012, 4),
(3, 'Polvo', 'Julio Hern√°ndez Cord√≥n', 'Guatemala', 80, 2012, 5),
(4, 'Rosa', 'Wodjciechs Marzowski', 'Polonia', 94, 2012, 6),
(5, 'La demora', 'Rodr√≠go Pl√°', 'Uruguay', 84, 2012, 4),
(6, 'Los salvajes', 'Alejandro Fadel', 'Argentina', 119, 2012, 3),
(7, 'El hombre que vendr√°', 'Giorgio Diritti', 'Italia', 117, 2009, 8),
(8, 'La suerte en tus manos', 'Daniel Burman', 'Argentina', 107, 2011, 1),
(9, 'Elefante blanco', 'Pablo Trapero', 'Argentina', 110, 2012, 4),
(10, 'La lucha de Ana', 'Bladimir Abud', 'Rep√∫blica', 90, 2011, 1),
(11, 'Pescador', 'Sebasti√°n Cordero', 'Ecuador', 96, 2011, 4),
(12, 'Mi universo en min√∫sculas', 'Hatuey Viveros', 'M√©xico', 90, 2011, 3),
(13, 'Hoy', 'Tata Amaral', 'Brasil', 82, 2011, 4),
(14, 'La pel√≠cula de Ana', 'Daniel D√≠az Torres', 'Cuba', 100, 2012, 4),
(15, 'Cornelia frente al espejo', 'Daniel Rosenfeld', 'Argentina', 103, 2012, 3),
(16, 'Melaza', 'Carlos Lechuga', 'Cuba', 80, 2012, 3),
(17, 'Villegas', 'Gonzalo Tobal', 'Argentina', 98, 2012, 3),
(18, 'Las cosas como son', 'Fernando Lavanderos Montero', 'Chile', 105, 2012, 4),
(19, 'Choc√≥', 'Jhonny Hendrix Hinestroza', 'Colombia', 80, 2011, 3),
(20, 'El √∫ltimo tren a casa', 'Lixin Fan', 'Canad√°', 85, 2009, 9),
(21, 'B√°rbara', 'Christian Petzold', 'Alemania', 105, 2012, 10),
(22, 'El p√°ramo', 'Jaime Osorio M√°rquez', 'Colombia', 107, 2011, 1),
(23, 'No', 'Pablo Larra√≠n', 'Chile', 115, 2012, 4),
(24, 'De martes a martes', 'Gustavo Fern√°ndez Trivi√±o', 'Argentina', 94, 2011, 3),
(25, 'El gran sue√±o de Konrad Koch', 'Sebastian Groebler', 'Alemania', 113, 2010, 10),
(26, 'Violeta se fue a los cielos', 'Andr√©s Wood', 'Chile', 110, 2011, 4),
(27, 'Viento de Oeste', 'Robert Thalheim', 'Alemania', 89, 2011, 10),
(28, 'Par√≥n en el camino', 'Andreas Dresen', 'Alemania', 110, 2011, 10),
(29, 'Evelyn', 'Isabel de Ocampo', 'Espa√±a', 96, 2011, 11),
(30, 'Era uma vez eu, Ver√≥nica', 'Marcelo G√≥mes', 'Brasil', 91, 2011, 4),
(31, 'Penumbras', 'Charlie Medina', 'Cuba', 79, 2012, 3),
(32, 'Los equilibristas', 'Ivano de Matteo', 'Italia', 100, 2012, 8),
(33, 'Un hogar de fin de semana', 'Hans-Christian Schmid', 'Alemania', 85, 2012, 10),
(34, 'Jaque mate', 'Jos√© Mar√≠a Cabral', 'Rep√∫blica', 80, 2011, 1),
(35, 'Fausto', 'Alexander Sokurov', 'Rusia', 134, 2011, 2),
(36, 'Monsieur Lazhar', 'Philippe Falardeau', 'Canad√°', 94, 2011, 9),
(37, 'Starbuck', 'Ken Scott', 'Canad√°', 109, 2011, 9);

 * mysql://root:***@localhost:3306
37 rows affected.

[]

In [11]:
%%sql 

CREATE TABLE IF NOT EXISTS Pel√≠culaGanadora (
  IDPremiada int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  IDPeli INT REFERENCES Pel√≠cula(IDPeli) ON UPDATE CASCADE,
  NombrePremio varchar(100) COLLATE utf8_unicode_ci NOT NULL
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [12]:
%%sql 

INSERT INTO `Pel√≠culaGanadora` (`IDPremiada`, `IDPeli`, `NombrePremio`) VALUES
(1, 16, '6to Premio de la Popularidad'),
(2, 16, 'Premio El M√©gano'),
(3, 9, 'Premio Coral de Edici√≥n'),
(4, 9, 'Menci√≥n SIGNIS'),
(5, 9, '5to Premio de la Popularidad'),
(6, 9, 'Premio Caminos'),
(7, 14, 'Premio Coral de Actuaci√≥n Femenina'),
(8, 14, 'Premio Coral de Gui√≥n'),
(9, 14, 'Premio de Distribuci√≥n de Amazonia Films'),
(10, 14, '2do Premio de la Popularidad'),
(11, 14, 'Premio Otorgado por el C√≠rculo de Periodistas de Cultura de la UPEC'),
(12, 5, 'Premio Coral de M√∫sica Original'),
(13, 5, 'Premio √önete'),
(14, 11, 'Premio Coral de Actuaci√≥n Masculina'),
(15, 30, 'Menci√≥n del Jurado'),
(16, 23, '1er Premio Coral'),
(17, 23, 'Premio SIGNIS'),
(18, 23, '3er Premio de la Popularidad'),
(19, 23, 'Premio de la Asociaci√≥n Cubana de la Prensa Cinematogr√°fica'),
(20, 19, 'Premio Roque Dalton'),
(21, 6, '2do Premio Coral'),
(22, 6, 'Premio Coral a la Mejor Contribuci√≥n Art√≠stica (Mejor Direcci√≥n)'),
(23, 26, '2do Premio Coral'),
(24, 26, 'Premio Coral de Direcci√≥n Art√≠stica'),
(25, 26, 'Premio de la Asociaci√≥n de Cine, Radio y Televisi√≥n de la UNEAC'),
(26, 26, 'Premio Glauber Rocha');

 * mysql://root:***@localhost:3306
26 rows affected.

[]

> **Voz en off con tono grave:**  Contando con esta informaci√≥n se puede entonces dar respuesta a los siguientes incisos utilizando el
lenguaje SQL.

a) Obtenga la cantidad de pel√≠culas registradas por cada director.

In [13]:
%%sql

SELECT Director, COUNT(*) AS cantidad_peliculas
FROM Pel√≠cula
GROUP BY Director;

 * mysql://root:***@localhost:3306
37 rows affected.

[('R√©mi Bezan√ßon', 1),
 ('In√©s de Oliveira C√©zar', 1),
 ('Julio Hern√°ndez Cord√≥n', 1),
 ('Wodjciechs Marzowski', 1),
 ('Rodr√≠go Pl√°', 1),
 ('Alejandro Fadel', 1),
 ('Giorgio Diritti', 1),
 ('Daniel Burman', 1),
 ('Pablo Trapero', 1),
 ('Bladimir Abud', 1),
 ('Sebasti√°n Cordero', 1),
 ('Hatuey Viveros', 1),
 ('Tata Amaral', 1),
 ('Daniel D√≠az Torres', 1),
 ('Daniel Rosenfeld', 1),
 ('Carlos Lechuga', 1),
 ('Gonzalo Tobal', 1),
 ('Fernando Lavanderos Montero', 1),
 ('Jhonny Hendrix Hinestroza', 1),
 ('Lixin Fan', 1),
 ('Christian Petzold', 1),
 ('Jaime Osorio M√°rquez', 1),
 ('Pablo Larra√≠n', 1),
 ('Gustavo Fern√°ndez Trivi√±o', 1),
 ('Sebastian Groebler', 1),
 ('Andr√©s Wood', 1),
 ('Robert Thalheim', 1),
 ('Andreas Dresen', 1),
 ('Isabel de Ocampo', 1),
 ('Marcelo G√≥mes', 1),
 ('Charlie Medina', 1),
 ('Ivano de Matteo', 1),
 ('Hans-Christian Schmid', 1),
 ('Jos√© Mar√≠a Cabral', 1),
 ('Alexander Sokurov', 1),
 ('Philippe Falardeau', 1),
 ('Ken Scott', 1)]

b) Recupere ordenados alfab√©ticamente los nombres de aquellas secciones en las que se presentaron pel√≠culas cubanas o argentinas cuya duraci√≥n era de 90 minutos o m√°s.

In [14]:
%%sql

SELECT DISTINCT s.Nombre
FROM Secci√≥n AS s
    JOIN Pel√≠cula AS p ON s.IDSecc = p.IDSecc
WHERE p.Pa√≠s IN ('Cuba', 'Argentina') AND p.Duraci√≥n >= 90
ORDER BY s.Nombre;

 * mysql://root:***@localhost:3306
3 rows affected.

[('Ficci√≥n',), ('√ìperas Primas',), ('Panorama Latinoamericano',)]

c) Obtener el tiempo m√°ximo de pel√≠cula registrado por cada secci√≥n.

In [15]:
%%sql

SELECT s.Nombre, MAX(p.Duraci√≥n) AS duracion_maxima
FROM Secci√≥n AS s
    JOIN Pel√≠cula AS p ON s.IDSecc = p.IDSecc
GROUP BY s.Nombre
# ORDER BY duracion_maxima DESC

 * mysql://root:***@localhost:3306
10 rows affected.

[('Panorama Contempor√°neo Internacional', 134),
 ('Ficci√≥n', 115),
 ('World Cinema Fund', 80),
 ('Muestra de Cine Polaco', 94),
 ('√ìperas Primas', 119),
 ('Muestra de Cine Italiano', 117),
 ('Panorama Latinoamericano', 107),
 ('Muestra de Cine Canadiense', 109),
 ('Muestra de Cine Alem√°n', 113),
 ('Muestra de Cine Espa√±ol', 96)]

d) Obtener el nombre de las secciones que cuentan con jueces con menos de 20 a√±os.

In [16]:
%%sql

SELECT DISTINCT s.Nombre
FROM Secci√≥n AS s
    JOIN Jurado AS j ON s.IDSecc = j.IDSecc
WHERE j.FechaDeNacimiento > YEAR(FechaDeNacimiento) - 20

 * mysql://root:***@localhost:3306
3 rows affected.

[('Ficci√≥n',), ('√ìperas Primas',), ('Documental',)]

¬øSecciones y la cantidad con menos 20 a√±os?

In [17]:
%%sql

SELECT s.Nombre, COUNT(FechaDeNacimiento) as cantidad_con_menos_de_20_a√±os
FROM Secci√≥n AS s
    JOIN Jurado AS j ON s.IDSecc = j.IDSecc
WHERE j.FechaDeNacimiento > YEAR(FechaDeNacimiento) - 20 
GROUP BY s.Nombre;

 * mysql://root:***@localhost:3306
3 rows affected.

[('Ficci√≥n', 5), ('√ìperas Primas', 3), ('Documental', 3)]

ups, y con m√°s de 20!?

e) Obtener ordenadas por t√≠tulo las pel√≠culas producidas entre el 2011 y el 2012 que obtuvieron premios.

In [18]:
%%sql

SELECT p.T√≠tulo, pg.NombrePremio
    FROM Pel√≠cula p
    JOIN Pel√≠culaGanadora pg ON p.IDPeli = pg.IDPeli
WHERE p.A√±o BETWEEN 2011 AND 2012
ORDER BY p.T√≠tulo;

 * mysql://root:***@localhost:3306
26 rows affected.

[('Choc√≥', 'Premio Roque Dalton'),
 ('Elefante blanco', 'Premio Coral de Edici√≥n'),
 ('Elefante blanco', 'Menci√≥n SIGNIS'),
 ('Elefante blanco', '5to Premio de la Popularidad'),
 ('Elefante blanco', 'Premio Caminos'),
 ('Era uma vez eu, Ver√≥nica', 'Menci√≥n del Jurado'),
 ('La demora', 'Premio Coral de M√∫sica Original'),
 ('La demora', 'Premio √önete'),
 ('La pel√≠cula de Ana', 'Premio Coral de Actuaci√≥n Femenina'),
 ('La pel√≠cula de Ana', 'Premio Coral de Gui√≥n'),
 ('La pel√≠cula de Ana', 'Premio de Distribuci√≥n de Amazonia Films'),
 ('La pel√≠cula de Ana', '2do Premio de la Popularidad'),
 ('La pel√≠cula de Ana', 'Premio Otorgado por el C√≠rculo de Periodistas de Cultura de la UPEC'),
 ('Los salvajes', '2do Premio Coral'),
 ('Los salvajes', 'Premio Coral a la Mejor Contribuci√≥n Art√≠stica (Mejor Direcci√≥n)'),
 ('Melaza', '6to Premio de la Popularidad'),
 ('Melaza', 'Premio El M√©gano'),
 ('No', '1er Premio Coral'),
 ('No', 'Premio SIGNIS'),
 ('No', '3er Premio de la Popularidad'),
 ('No', 'Premio de la Asociaci√≥n Cubana de la Prensa Cinematogr√°fica'),
 ('Pescador', 'Premio Coral de Actuaci√≥n Masculina'),
 ('Violeta se fue a los cielos', '2do Premio Coral'),
 ('Violeta se fue a los cielos', 'Premio Coral de Direcci√≥n Art√≠stica'),
 ('Violeta se fue a los cielos', 'Premio de la Asociaci√≥n de Cine, Radio y Televisi√≥n de la UNEAC'),
 ('Violeta se fue a los cielos', 'Premio Glauber Rocha')]

f) Las secciones s√≥lo pueden ser del tipo "En competencia" o "Fuera de competencia". Muestre la cantidad y el promedio de duraci√≥n de las pel√≠culas presentadas en cada uno de estos tipos de secci√≥n.

In [19]:
%%sql 

SELECT s.Tipo AS TipoSeccion, COUNT(p.IDPeli) AS CantidadPeliculas, AVG(p.Duraci√≥n) AS PromedioDuracion
    FROM Secci√≥n s
    JOIN Pel√≠cula p ON s.IDSecc = p.IDSecc
WHERE s.Tipo IN ('En competencia', 'Fuera de competencia')
GROUP BY s.Tipo;

 * mysql://root:***@localhost:3306
2 rows affected.

[('Fuera de competencia', 19, Decimal('100.1053')),
 ('En competencia', 18, Decimal('95.8889'))]

g) Obtener el t√≠tulo, director y la cantidad de premios recibidos por las 5 pel√≠culas m√°s laureadas.

In [20]:
%%sql 

SELECT p.T√≠tulo, p.Director, COUNT(pg.NombrePremio) AS CantidadPremios
    FROM Pel√≠cula p
    JOIN Pel√≠culaGanadora pg ON p.IDPeli = pg.IDPeli
GROUP BY p.T√≠tulo, p.Director
ORDER BY COUNT(pg.NombrePremio) DESC
LIMIT 5;

 * mysql://root:***@localhost:3306
5 rows affected.

[('La pel√≠cula de Ana', 'Daniel D√≠az Torres', 5),
 ('Elefante blanco', 'Pablo Trapero', 4),
 ('Violeta se fue a los cielos', 'Andr√©s Wood', 4),
 ('No', 'Pablo Larra√≠n', 4),
 ('Melaza', 'Carlos Lechuga', 2)]

h) Obtenga todos los t√≠tulos y pa√≠ses de las pel√≠culas del a√±o 2012 que concursaron en la secci√≥n de "√ìperas Primas" y obtuvieron m√°s de un premio.

In [21]:
%%sql

SELECT p.T√≠tulo, p.Pa√≠s
FROM Pel√≠cula p
    JOIN Pel√≠culaGanadora pg ON p.IDPeli = pg.IDPeli
    JOIN Secci√≥n s ON p.IDSecc = s.IDSecc
WHERE p.A√±o = 2012 AND s.Nombre = '√ìperas Primas'
GROUP BY p.T√≠tulo, p.Pa√≠s
HAVING COUNT(pg.NombrePremio) > 1;

 * mysql://root:***@localhost:3306
2 rows affected.

[('Melaza', 'Cuba'), ('Los salvajes', 'Argentina')]

i) Obtenga el nombre de los miembros del jurado que participaron en secciones en las que se premiaron al menos a cinco pel√≠culas distintas. Los jurados deben aparecer ordenados seg√∫n su edad, comenzando por el mayor.

In [22]:
%%sql 

SELECT Jurado.Nombre
FROM Jurado
WHERE Jurado.IDSecc IN (
    SELECT IDSecc
    FROM Pel√≠culaGanadora NATURAL JOIN Pel√≠cula
    GROUP BY IDSecc
    HAVING COUNT(DISTINCT IDPeli) > 5
)
ORDER BY FechaDeNacimiento

 * mysql://root:***@localhost:3306
5 rows affected.

[('√örsula Pruneda',),
 ('Concei√ß√°o Senna',),
 ('Boris Quercia',),
 ('Gast√≥n Pauls',),
 ('Manuel Herrera',)]

j) Muestre los jueces que se han asignado a secciones en las que participan pel√≠culas de su mismo pa√≠s. Agregue tambi√©n su pa√≠s y la secci√≥n involucrada.

In [23]:
%%sql

SELECT j.Nombre as Juez, j.Pa√≠s, s.Nombre as Seccion
FROM Jurado as j
    INNER JOIN Secci√≥n as s
        ON j.IDSecc = s.IDSecc
WHERE s.IDSecc in (
    SELECT DISTINCT(p.IDSecc)
    FROM Pel√≠cula as p
    WHERE p.Pa√≠s = j.Pa√≠s
)

 * mysql://root:***@localhost:3306
5 rows affected.

[('Boris Quercia', 'Chile', 'Ficci√≥n'),
 ('Gast√≥n Pauls', 'Argentina', 'Ficci√≥n'),
 ('Concei√ß√°o Senna', 'Brasil', 'Ficci√≥n'),
 ('Manuel Herrera', 'Cuba', 'Ficci√≥n'),
 ('Esteban Insausti', 'Cuba', '√ìperas Primas')]

k) Obtener el nombre y la cantidad total de pel√≠culas asociadas a las secciones en las que se hayan registrado al menos 1 pel√≠cula ganadora.

In [24]:
%%sql

SELECT sec.IDSecc, sec.Nombre, COUNT(*) as total
FROM(
    SELECT s.IDSecc, s.Nombre
    FROM (Pel√≠culaGanadora as pg
        INNER JOIN Pel√≠cula as p
            ON pg.IDPeli = p.IDPeli)
        JOIN Secci√≥n as s ON s.IDSecc = p.IDSecc 
    GROUP BY s.IDSecc) as sec
INNER JOIN Pel√≠cula as pel ON sec.IDSecc = pel.IDSecc
GROUP BY sec.IDSecc

 * mysql://root:***@localhost:3306
2 rows affected.

[(4, 'Ficci√≥n', 10), (3, '√ìperas Primas', 8)]

l) Presente el t√≠tulo y el director de las pel√≠culas que fueron galardonadas y poseen una duraci√≥n mayor que el promedio.

In [25]:
%%sql

SELECT DISTINCT(p.IDPeli), p.T√≠tulo, p.Director, p.Duraci√≥n
FROM Pel√≠cula as p
    INNER JOIN Pel√≠culaGanadora as pg
        ON p.IDPeli = pg.IDPeli
WHERE p.Duraci√≥n > (
        SELECT AVG(Duraci√≥n)
        FROM Pel√≠cula
    )

 * mysql://root:***@localhost:3306
5 rows affected.

[(9, 'Elefante blanco', 'Pablo Trapero', 110),
 (14, 'La pel√≠cula de Ana', 'Daniel D√≠az Torres', 100),
 (23, 'No', 'Pablo Larra√≠n', 115),
 (6, 'Los salvajes', 'Alejandro Fadel', 119),
 (26, 'Violeta se fue a los cielos', 'Andr√©s Wood', 110)]